# 숫자 빈도수(14912번)
#######################################################################################
    # 문제: https://www.acmicpc.net/problem/14912
    # 브루트포스
    # 정수 N이 주어졌을 때, 각 자리수를 구하는 방법을 알면 쉽게 풀 수 있는 문제이다.(문자열로 변환하지 않고)
#######################################################################################
import sys
input = sys.stdin.readline

N, i = map(int, input().split())
cnt = 0

for num in range(1, N + 1):
    count = [0] * 10
    while num > 0:
        count[num % 10] += 1
        num //= 10
    cnt += count[i]
print(cnt)
